package app;

public class SubGeneration {


        public static Subscriber[]generateSubArray() {

            Subscriber[] array = new Subscriber[10];

            array[0] = new Subscriber(7854,"Oнищенко", "Олег","Дніпро", "+380975458795",
                    897, 100.37, 60, 0, 25);

            array[1] = new Subscriber(6582,"Гончаренко", "Віктор","Кам'янське", "+380982542369",
                    547, 98.54,52, 25, 15);

            array[2] = new Subscriber(2104,"Олефіренко", "Ігнат","Ужгород", "+380972134758",
                    852, -101.41,80, 47, 35);

            array[3] = new Subscriber(2528,"Рубан", "Роман","Дніпро", "+380974789589",
                    458, 150.25, 75, 30, 40);

            array[4] = new Subscriber(2174,"Цибульська", "Світлана","Тернопіль", "+380998966547",
                    475, 148.14, 92, 20, 32);

            array[5] = new Subscriber(2568,"Гапіч", "Генадій","Дніпро", "+380974587893",
                    625, 300.45, 50, 60, 58);

            array[6] = new Subscriber(4587,"Шейко", "Віктор","Вінниця", "+380974523258",
                    452, 100.21,45, 40, 30);

            array[7] = new Subscriber(6325,"Гапіч", "Інна","Дніпро", "+380971236364",
                    211, 145.48, 50, 50, 50);

            array[8] = new Subscriber(8756,"Рудий", "Родіон","Суми", "+380985678475",
                    698, 450.25, 100, 0, 45);

            array[9] = new Subscriber(2104,"Рідна", "Мілана","Запоріжжя", "+380998755423",
                    952, -305.11, 200, 0, 50);

            return array;

        }

    }





